In [1]:
import pandas as pd

### **aut_train DataFrame**

In [2]:
df = pd.read_csv('../data/train/aug_train.csv')
df.sample(5)

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target
13853,6737,city_71,0.884,NaN,Has relevent experience,Part time course,Masters,STEM,10,100-500,NaN,3,7,0.0
13127,24590,city_103,0.920,NaN,No relevent experience,Full time course,Graduate,STEM,2,50-99,NGO,1,20,0.0
9311,13029,city_160,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,10,100-500,Pvt Ltd,4,117,0.0
8941,30145,city_114,0.926,Male,No relevent experience,Full time course,High School,NaN,6,NaN,Pvt Ltd,1,37,0.0
14656,13164,city_136,0.897,Male,Has relevent experience,no_enrollment,Masters,STEM,16,100-500,Pvt Ltd,2,72,0.0

In [3]:
# !pip install pandas-profiling

In [4]:
from pandas_profiling import ProfileReport
prof = ProfileReport(df)
prof.to_file(output_file='aug_train.html')

<ipython-input-4-d28e5cd1efbc>:1: DeprecationWarning: `import pandas_profiling` is going to be deprecated by April 1st. Please use `import ydata_profiling` instead.
  from pandas_profiling import ProfileReport

Summarize dataset:   0%|          | 0/5 [00:00<?, ?it/s]

Generate report structure:   0%|          | 0/1 [00:00<?, ?it/s]

Render HTML:   0%|          | 0/1 [00:00<?, ?it/s]

Export report to file:   0%|          | 0/1 [00:00<?, ?it/s]

In [5]:
df.sample(5)

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target
5190,16615,city_162,0.767,NaN,Has relevent experience,no_enrollment,Graduate,NaN,16,NaN,NaN,NaN,43,0.0
7733,18627,city_116,0.743,Male,Has relevent experience,no_enrollment,Masters,Humanities,3,<10,Pvt Ltd,1,28,0.0
4350,14711,city_158,0.766,Male,Has relevent experience,no_enrollment,Graduate,STEM,11,500-999,Pvt Ltd,never,58,0.0
10562,11575,city_114,0.926,Male,Has relevent experience,no_enrollment,Masters,STEM,>20,100-500,NaN,>4,12,0.0
18928,16740,city_16,0.910,NaN,Has relevent experience,no_enrollment,Graduate,STEM,9,1000-4999,Pvt Ltd,2,33,0.0

### **titanic DataFrame**

In [6]:
df = pd.read_csv('../data/titanic/titanic.csv')
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
413,1305,0,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,0,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,0,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,0,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [7]:
prof = ProfileReport(df)
prof.to_file(output_file='titanic.html')

Summarize dataset:   0%|          | 0/5 [00:00<?, ?it/s]

Generate report structure:   0%|          | 0/1 [00:00<?, ?it/s]

Render HTML:   0%|          | 0/1 [00:00<?, ?it/s]

Export report to file:   0%|          | 0/1 [00:00<?, ?it/s]

### **placement.csv DataFrame**

In [8]:
df = pd.read_csv('placement/placement.csv')
df.sample(5)

    Unnamed: 0  cgpa     iq  placement
53          53   8.3  168.0          1
78          78   6.1   81.0          0
92          92   5.2  110.0          0
81          81   5.4  107.0          0
99          99   6.2  113.0          1

In [9]:
df.drop(df.columns[0], axis=1, inplace=True)

In [10]:
df

    cgpa     iq  placement
0    6.8  123.0          1
1    5.9  106.0          0
2    5.3  121.0          0
3    7.4  132.0          1
4    5.8  142.0          0
..   ...    ...        ...
95   4.3  200.0          0
96   4.4   42.0          0
97   6.7  182.0          1
98   6.3  103.0          1
99   6.2  113.0          1

[100 rows x 3 columns]

In [11]:
prof = ProfileReport(df)
prof.to_file(output_file='placement.html')

Summarize dataset:   0%|          | 0/5 [00:00<?, ?it/s]

Generate report structure:   0%|          | 0/1 [00:00<?, ?it/s]

Render HTML:   0%|          | 0/1 [00:00<?, ?it/s]

Export report to file:   0%|          | 0/1 [00:00<?, ?it/s]